import Athar from "./components/Athar";
function App() {
  return (
    <>
      <h1>آثار وفوائد سلفية</h1>
      <Athar
        text={`عن أبي غالبٍ ، مَوْلَى خالد بن عبد اللَّه القرشيِّ قال :
          كان ابْنُ عُمَرَ يَنْزِلُ علينا بِمَكَّةَ ، 
          وكان يَتَهَجَّدُ مِنَ اللَّيْلِ فقال لي ذاتَ لَيْلَةٍ قَبْلَ الصُّبْحِ : 
          يا أَبا غالِبٍ ، أَلاَ تَقُومُ تُصَلِّي ولو تَقْرَأُ بِثُلُثِ القرآن ؟
          فقلتُ : يا أبا عبدالرحمن قَدْ دَنا الصُّبْحُ فكيف أَقرأُ بِثُلُثِ الْقُرْآنِ ؟ 
          قال : إِنَّ سُورَةَ الإِخْلاَصِ {قُلْ هُوَ اللَّهُ أَحَدٌ} تَعْدِلُ ثُلُثَ القرآن`}
        narrator={"عبدالله بن عمر بن الخطاب رضي الله عنهما"}
      />
      <Athar
        text={`ابن آدم، طأ الأرض بقدمك ، فإنها عن قليل قبرك 
          فوالله ما زلت في هدم عمرك منذ سقطت من بطن أمك...!`}
        narrator={`الإمام التابعي الحسن البصري`}
      />
      <Athar
        text={`{يَا أَيُّهَا الَّذِينَ آمَنُوا قُوا أَنْفُسَكُمْ وَأَهْلِيكُمْ نَارًا}
          قال التابعي قتادة رحمه الله  :
          يأمرهم بطاعة الله، وينهاهم عن معصيته، وأن يقوم عليه بأمر الله يأمرهم به ويساعدهم عليه، فإذا رأيت لله معصية ردعتهم عنها، وزجرتهم عنها.`}
        narrator={`الإمام التابعي قتادة بن دعامة`}
      />
    </>
  );
}

export default App;
